#include "Std.h"
#include <stdio.h>

void main()
{	
	// 디버그 끄기 shift + f5
	// f9 빨간점은 블랙 포인트 
	// f11 함수 안으로 들어간다 (함수 확인)
	// ;\ - 다음줄도 같은줄로 적용

	// 1차원 배열 - 가로의 개수가 정해져 있을 때
	// 2차원 배열 - 가로 및 세로의 개수가 정해져 있을 때
	// 1차원 포인터 - 가로의 개수가 정해지지 않았을 때
	// 2차원 포인터 - 가로 및 세로의 개수가 정해지지 않았을 때
	// 포인터 배열 - 가로는 정해져 있고 세로는 정해지지 않았을 때

	// 배열은 함수 헤더로 넘어갈때 참조로 넘어간다

	// const = 변수를 상수화

	// void (*game)(); -> 함수 포인터

	// 구조체 변수 생성	=> 객체 생성
	// ex) Tnode node;
	// 메모리 확보		=> 인스턴스 생성 = 메모리 실체화
	// ex) Tnode* node;

	// 비트 필드 구조체 + 공용체 -> 압축,최적화


}